{"config": {"input_layers": [["words_input", 0, 0]], "layers": [{"config": {"input_dtype": "int32", "sparse": false, "batch_input_shape": [null, 100], "name": "words_input"}, "inbound_nodes": [], "name": "words_input", "class_name": "InputLayer"}, {"config": {"activity_regularizer": null, "init": "uniform", "W_regularizer": null, "input_length": null, "trainable": false, "batch_input_shape": [null, null], "input_dtype": "int32", "output_dim": 300, "mask_zero": false, "W_constraint": null, "dropout": 0.0, "name": "embedding_1", "input_dim": 20000}, "inbound_nodes": [[["words_input", 0, 0]]], "name": "embedding_1", "class_name": "Embedding"}, {"config": {"p": 0.2, "trainable": true, "name": "dropout_1"}, "inbound_nodes": [[["embedding_1", 0, 0]]], "name": "dropout_1", "class_name": "Dropout"}, {"config": {"stateful": false, "forget_bias_init": "one", "dropout_W": 0.2, "W_regularizer": null, "input_length": null, "activation": "tanh", "trainable": true, "consume_less": "cpu", "return_sequences": true, "U_regularizer": null, "unroll": false, "go_backwards": false, "output_dim": 128, "inner_activation": "hard_sigmoid", "name": "lstm_1", "dropout_U": 0.2, "input_dim": 300, "b_regularizer": null, "inner_init": "orthogonal", "init": "glorot_uniform"}, "inbound_nodes": [[["dropout_1", 0, 0]]], "name": "lstm_1", "class_name": "LSTM"}, {"config": {"p": 0.2, "trainable": true, "name": "dropout_2"}, "inbound_nodes": [[["lstm_1", 0, 0]]], "name": "dropout_2", "class_name": "Dropout"}, {"config": {"trainable": true, "name": "attentionlayer_1"}, "inbound_nodes": [[["dropout_2", 0, 0]]], "name": "attentionlayer_1", "class_name": "AttentionLayer"}, {"config": {"output_mask_type": "raw", "arguments": {}, "output_shape_type": "lambda", "mode_type": "lambda", "output_shape": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\b\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u0019S)\u0002N\u00e9\u0000\u0000\u0000\u0000\u00a9\u0000)\u0001\u00da\u0001xr\u0002\u0000\u0000\u0000r\u0002\u0000\u0000\u0000\u00fa\u0011lstm_attention.py\u00da\b<lambda>\u00c2\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "concat_axis": -1, "output_mask": null, "mode": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0003\u0000\u0000\u0000S\u0000\u0000\u0000s\u0010\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u0019|\u0000\u0000d\u0002\u0000\u0019\u0014S)\u0003N\u00e9\u0001\u0000\u0000\u0000\u00e9\u0000\u0000\u0000\u0000\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\u0011lstm_attention.py\u00da\b<lambda>\u00c2\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "dot_axes": -1, "name": "merge_1"}, "inbound_nodes": [[["dropout_2", 0, 0], ["attentionlayer_1", 0, 0]]], "name": "merge_1", "class_name": "Merge"}, {"config": {"arguments": {}, "output_shape_type": "lambda", "output_shape": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0003\u0000\u0000\u0000S\u0000\u0000\u0000s\u0012\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u0019|\u0000\u0000d\u0002\u0000\u0019f\u0002\u0000S)\u0003N\u00e9\u0000\u0000\u0000\u0000\u00e9\u0002\u0000\u0000\u0000\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\u0011lstm_attention.py\u00da\b<lambda>\u00c3\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0004\u0000\u0000\u0000S\u0000\u0000\u0000s\u0013\u0000\u0000\u0000t\u0000\u0000j\u0001\u0000|\u0000\u0000d\u0001\u0000d\u0002\u0000\u0083\u0001\u0001S)\u0003N\u00da\u0004axis\u00e9\u0001\u0000\u0000\u0000)\u0002\u00da\u0001K\u00da\u0003sum)\u0001\u00da\u0001x\u00a9\u0000r\u0006\u0000\u0000\u0000\u00fa\u0011lstm_attention.py\u00da\b<lambda>\u00c3\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_1", "function_type": "lambda"}, "inbound_nodes": [[["merge_1", 0, 0]]], "name": "lambda_1", "class_name": "Lambda"}, {"config": {"activity_regularizer": null, "input_dim": 128, "W_regularizer": null, "trainable": true, "activation": "sigmoid", "output_dim": 1, "W_constraint": null, "bias": true, "init": "glorot_uniform", "b_regularizer": null, "name": "documentOut", "b_constraint": null}, "inbound_nodes": [[["lambda_1", 0, 0]]], "name": "documentOut", "class_name": "Dense"}], "output_layers": [["documentOut", 0, 0]], "name": "model_1"}, "keras_version": "1.2.2", "class_name": "Model"}