{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"init": "uniform", "W_regularizer": null, "output_dim": 300, "input_dim": 20000, "mask_zero": false, "batch_input_shape": [null, 70], "name": "embedding_1", "dropout": 0.0, "W_constraint": null, "trainable": false, "input_length": 70, "input_dtype": "int32", "activity_regularizer": null}}, {"class_name": "Bidirectional", "config": {"merge_mode": "concat", "layer": {"class_name": "LSTM", "config": {"stateful": false, "go_backwards": false, "init": "glorot_uniform", "inner_activation": "hard_sigmoid", "return_sequences": false, "b_regularizer": null, "inner_init": "orthogonal", "input_dim": 300, "consume_less": "cpu", "name": "forward_lstm_1", "U_regularizer": null, "forget_bias_init": "one", "W_regularizer": null, "trainable": true, "dropout_W": 0.2, "output_dim": 128, "dropout_U": 0.2, "activation": "tanh", "unroll": false, "input_length": null}}, "trainable": true, "name": "bidirectional_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"b_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "input_dim": 256, "name": "dense_1", "bias": true, "W_constraint": null, "trainable": true, "output_dim": 1, "activity_regularizer": null, "activation": "sigmoid"}}], "keras_version": "1.2.1"}