{"config": [{"config": {"W_constraint": null, "name": "embedding_2", "mask_zero": false, "output_dim": 300, "dropout": 0.0, "init": "uniform", "W_regularizer": null, "input_length": 50, "batch_input_shape": [null, 50], "trainable": false, "activity_regularizer": null, "input_dim": 20000, "input_dtype": "int32"}, "class_name": "Embedding"}, {"config": {"name": "lstm_2", "dropout_W": 0.2, "stateful": false, "output_dim": 100, "go_backwards": false, "unroll": false, "W_regularizer": null, "input_length": null, "U_regularizer": null, "forget_bias_init": "one", "trainable": true, "init": "glorot_uniform", "input_dim": 300, "consume_less": "cpu", "inner_activation": "hard_sigmoid", "return_sequences": false, "b_regularizer": null, "inner_init": "orthogonal", "dropout_U": 0.2, "activation": "tanh"}, "class_name": "LSTM"}, {"config": {"name": "dropout_2", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"W_constraint": null, "name": "dense_2", "output_dim": 1, "b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "input_dim": 100, "bias": true, "activation": "sigmoid", "b_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.1"}